src/main/resources/xml/GetQueryCuotificacion/GetQueryCuotificacion_soap1_2-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="https://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="https://www.w3.org/2001/XMLSchema"
                 xmlns:soap12="https://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <GetQueryCuotificacion xmlns="https://tempuri.org/">
            <numeroTarjeta>string</numeroTarjeta>
            <monto>string</monto>
            <cantCuotas>string</cantCuotas>
            <plan>string</plan>
            <moneda>string</moneda>
            <comercio>string</comercio>
            <origen>string</origen>
            <userId>string</userId>
            <programId>string</programId>
        </GetQueryCuotificacion>
    </soap12:Body>
</soap12:Envelope>

        <!--        POST /serviceconsulta.asmx HTTP/1.1-->
        <!--        Host: wscabalindividuosdev.cabal.coop-->
        <!--        Content-Type: application/soap+xml; charset=utf-8-->
        <!--        Content-Length: length-->

        <!--        HTTP/1.1 200 OK-->
        <!--        Content-Type: application/soap+xml; charset=utf-8-->
        <!--        Content-Length: length-->